In this dataset, we'll be analyzing a little over 6k Netflix shows focusing on the day that Netflix upload most of it's shows

There will be several factors to consider such as days of the week and others. The goal is to determine the day that Netflix upload most of it's shows.

In [116]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [117]:
df = pd.read_csv("netflix_titles.csv")
df.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,81145628,Movie,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","Alan Marriott, Andrew Toth, Brian Dobson, Cole...","United States, India, South Korea, China","September 9, 2019",2019,TV-PG,90 min,"Children & Family Movies, Comedies",Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,NaN,Jandino Asporaat,United Kingdom,"September 9, 2016",2016,TV-MA,94 min,Stand-Up Comedy,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,NaN,"Peter Cullen, Sumalee Montano, Frank Welker, J...",United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,Kids' TV,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,NaN,"Will Friedle, Darren Criss, Constance Zimmer, ...",United States,"September 8, 2018",2016,TV-Y7,1 Season,Kids' TV,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,Fernando Lebrija,"Nesta Cooper, Kate Walsh, John Michael Higgins...",United States,"September 8, 2017",2017,TV-14,99 min,Comedies,When nerdy high schooler Dani finally attracts...

In [118]:
df.shape

(6234, 12)

In [119]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6234 entries, 0 to 6233
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       6234 non-null   int64
 1   type          6234 non-null   object
 2   title         6234 non-null   object
 3   director      4265 non-null   object
 4   cast          5664 non-null   object
 5   country       5758 non-null   object
 6   date_added    6223 non-null   object
 7   release_year  6234 non-null   int64
 8   rating        6224 non-null   object
 9   duration      6234 non-null   object
 10  listed_in     6234 non-null   object
 11  description   6234 non-null   object
dtypes: int64(2), object(10)
memory usage: 584.6+ KB

In [120]:
df.nunique()

show_id         6234
type               2
title           6172
director        3301
cast            5469
country          554
date_added      1524
release_year      72
rating            14
duration         201
listed_in        461
description     6226
dtype: int64

In [121]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6234 entries, 0 to 6233
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       6234 non-null   int64
 1   type          6234 non-null   object
 2   title         6234 non-null   object
 3   director      4265 non-null   object
 4   cast          5664 non-null   object
 5   country       5758 non-null   object
 6   date_added    6223 non-null   object
 7   release_year  6234 non-null   int64
 8   rating        6224 non-null   object
 9   duration      6234 non-null   object
 10  listed_in     6234 non-null   object
 11  description   6234 non-null   object
dtypes: int64(2), object(10)
memory usage: 584.6+ KB

In [122]:
df.shape

(6234, 12)

Change "date added" column from object to date

In [123]:
df['date_added'] = pd.to_datetime(df['date_added'])

In [124]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6234 entries, 0 to 6233
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       6234 non-null   int64
 1   type          6234 non-null   object
 2   title         6234 non-null   object
 3   director      4265 non-null   object
 4   cast          5664 non-null   object
 5   country       5758 non-null   object
 6   date_added    6223 non-null   datetime64[ns]
 7   release_year  6234 non-null   int64
 8   rating        6224 non-null   object
 9   duration      6234 non-null   object
 10  listed_in     6234 non-null   object
 11  description   6234 non-null   object
dtypes: datetime64[ns](1), int64(2), object(9)
memory usage: 584.6+ KB

# 1- Count the number of shows added per day

In [125]:
show_count = df.groupby('date_added')[['show_id']].count()
show_count

            show_id
date_added
2008-01-01        1
2008-02-04        1
2009-05-05        1
2009-11-18        1
2010-11-01        1
...             ...
2020-01-14        4
2020-01-15        9
2020-01-16       10
2020-01-17        4
2020-01-18        1

[1189 rows x 1 columns]

# Extract the day name and sum up the shows added

In [126]:
show_count.index

DatetimeIndex(['2008-01-01', '2008-02-04', '2009-05-05', '2009-11-18',
               '2010-11-01', '2011-05-17', '2011-09-27', '2011-10-01',
               '2012-02-21', '2012-07-15',
               ...
               '2020-01-09', '2020-01-10', '2020-01-11', '2020-01-12',
               '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-18'],
              dtype='datetime64[ns]', name='date_added', length=1189, freq=None)

In [127]:
show_count['Day_of_week'] = show_count.index.day_name()
show_count

            show_id Day_of_week
date_added
2008-01-01        1     Tuesday
2008-02-04        1      Monday
2009-05-05        1     Tuesday
2009-11-18        1   Wednesday
2010-11-01        1      Monday
...             ...         ...
2020-01-14        4     Tuesday
2020-01-15        9   Wednesday
2020-01-16       10    Thursday
2020-01-17        4      Friday
2020-01-18        1    Saturday

[1189 rows x 2 columns]

In [128]:
show_count.groupby('Day_of_week').sum()

             show_id
Day_of_week
Friday          1910
Monday           694
Saturday         598
Sunday           564
Thursday         854
Tuesday          845
Wednesday        758

Select data from 2016 onwards

In [129]:
df.shape

(6234, 12)

In [130]:
mask=show_count.index >= '2016-01-01'

In [108]:
show_count[mask].index.min()

Timestamp('2016-01-01 00:00:00')

In [109]:
show_count = show_count[mask].copy()

In [110]:
show_count

            show_id Day_of_week
date_added
2016-01-01       34      Friday
2016-01-08        1      Friday
2016-01-13        1   Wednesday
2016-01-15        2      Friday
2016-01-22        1      Friday
...             ...         ...
2020-01-14        4     Tuesday
2020-01-15        9   Wednesday
2020-01-16       10    Thursday
2020-01-17        4      Friday
2020-01-18        1    Saturday

[1076 rows x 2 columns]

# Sum up weekly day

In [114]:
show_count.resample('1w').sum()

            show_id
date_added
2016-01-03       34
2016-01-10        1
2016-01-17        3
2016-01-24        2
2016-01-31        4
...             ...
2019-12-22       20
2019-12-29       19
2020-01-05      213
2020-01-12       19
2020-01-19       30

[212 rows x 1 columns]

# Conclusions

Netflix upload most of the movies on friday